lahirunirmalx/esp32-minitv/sdkconfig.defaults
# Freenove ESP32 Mini TV (FNK0112) — classic ESP32 (ESP-32S module), 4 MB
# flash, no PSRAM, 240x240 ST7789 over SPI, capacitive touch pad T9 (GPIO32).
# Pure ESP-IDF v5.5 baseline (no Arduino). Values ported from the proven
# phoebe/esp32_minitv firmware where they encode real board behavior.
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Run at the 240 MHz max for the fastest UI rendering.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=9000

# Classic ESP32 uses a CH340 UART console (no USB-JTAG like S3/C3/C6).
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Disable the brownout detector — USB power into this module regularly dips
# below the default threshold during WiFi PHY init, hard-resetting the board
# before the app gets anywhere. Confirmed on real hardware; do not re-enable.
CONFIG_ESP_BROWNOUT_DET=n
CONFIG_ESP_TASK_WDT_EN=n

# ---- Bluetooth: NimBLE (BLE-only) -----------------------------------------
# Peripheral role only: the device advertises a GATT service apps can use.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n

# ---- IRAM budget ------------------------------------------------------------
# WiFi + BT + LVGL on a classic ESP32 overflows IRAM with the default
# placement. Move hot-but-not-critical code into flash (small perf cost,
# required to link). Confirmed: without these the link fails by ~6 KB.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y

# ---- TLS / web client -------------------------------------------------------
# No PSRAM: dynamic mbedTLS buffers free the big TLS record buffers between
# requests, otherwise sequential HTTPS fetches fragment the heap -> bad_alloc.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_PEER_CERT=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
# Certificate bundle for https:// in web_client; "common" set keeps flash use
# reasonable on the 4 MB part.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# std::thread defaults: any worker thread an app spawns lands on core 0 with a
# usable stack, keeping LVGL rendering (core 1) free of network/JSON work.
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=16384
CONFIG_PTHREAD_TASK_CORE_DEFAULT=0

# ---- LVGL 9 (vendored component, configured via Kconfig) -------------------
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=16
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y
